zdfxdxy543/MotorAI/gmp_pro/ctl/suite/mcs_pmsm_nt - 副本/project/f280039c_Iris_node/F280039_Iris_node.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28003x" --part "F28003x_100PZ" --package "100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.03.00.00"
 * @v2CliArgs --device "TMS320F280039C" --package "100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.03.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const analog         = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1        = analog.addInstance();
const fsi            = scripting.addModule("/driverlib/board_components/fsi", {}, false);
const fsi1           = fsi.addInstance();
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const cputimer       = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1      = cputimer.addInstance();
const dac            = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1           = dac.addInstance();
const dac2           = dac.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const epwm3          = epwm.addInstance();
const epwm4          = epwm.addInstance();
const epwm5          = epwm.addInstance();
const epwm6          = epwm.addInstance();
const eqep           = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1          = eqep.addInstance();
const eqep2          = eqep.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const gpio3          = gpio.addInstance();
const gpio4          = gpio.addInstance();
const gpio5          = gpio.addInstance();
const gpio6          = gpio.addInstance();
const gpio7          = gpio.addInstance();
const gpio8          = gpio.addInstance();
const gpio9          = gpio.addInstance();
const i2c            = scripting.addModule("/driverlib/i2c.js", {}, false);
const i2c1           = i2c.addInstance();
const other          = scripting.addModule("/driverlib/other.js", {}, false);
const other1         = other.addInstance();
const sci            = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1           = sci.addInstance();
const sci2           = sci.addInstance();
const spi            = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1           = spi.addInstance();
const spi2           = spi.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                          = "IRIS_ADCA";
adc1.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc1.enabledInts                    = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1               = true;
adc1.enableInterrupt1ContinuousMode = true;
adc1.registerInterrupts             = ["1"];
adc1.soc0SampleWindow               = 9;
adc1.soc2SampleWindow               = 9;
adc1.soc1SampleWindow               = 9;
adc1.soc0Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0IndependentNameMode        = true;
adc1.soc1IndependentNameMode        = true;
adc1.soc2Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2IndependentNameMode        = true;
adc1.soc0Name                       = "INV_IU";
adc1.soc0Channel                    = "ADC_CH_ADCIN2";
adc1.soc1Name                       = "INV_IA";
adc1.soc1Channel                    = "ADC_CH_ADCIN8";
adc1.soc2Name                       = "INV_UA";
adc1.soc2Channel                    = "ADC_CH_ADCIN10";
adc1.soc3Name                       = "INV_UU";
adc1.soc3SampleWindow               = 9;
adc1.soc3Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3IndependentNameMode        = true;
adc1.soc3Channel                    = "ADC_CH_ADCIN6";
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4"];
adc1.soc4Name                       = "INV_VBUS";
adc1.soc4Channel                    = "ADC_CH_ADCIN11";
adc1.soc4Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc4SampleWindow               = 9;
adc1.soc4IndependentNameMode        = true;
adc1.adcInt1.interruptHandler       = "MainISR";
adc1.adcInt1.enableInterrupt        = true;

adc2.$name                   = "IRIS_ADCB";
adc2.adcBase                 = "ADCB_BASE";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.soc0SampleWindow        = 9;
adc2.soc1SampleWindow        = 9;
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1IndependentNameMode = true;
adc2.soc0IndependentNameMode = true;
adc2.soc2SampleWindow        = 9;
adc2.soc2IndependentNameMode = true;
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc0Name                = "INV_IV";
adc2.soc1Name                = "INV_IB";
adc2.soc2Name                = "INV_UB";
adc2.soc3Name                = "INV_UV";
adc2.soc3IndependentNameMode = true;
adc2.soc3SampleWindow        = 9;
adc2.soc0Channel             = "ADC_CH_ADCIN9";
adc2.soc1Channel             = "ADC_CH_ADCIN8";
adc2.soc3Channel             = "ADC_CH_ADCIN3";
adc2.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4"];
adc2.soc4Name                = "INV_IBUS";
adc2.soc4IndependentNameMode = true;
adc2.soc4Channel             = "ADC_CH_ADCIN12";
adc2.soc4Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc4SampleWindow        = 9;

adc3.$name                   = "IRIS_ADCC";
adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc3.soc0SampleWindow        = 9;
adc3.soc1SampleWindow        = 9;
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0IndependentNameMode = true;
adc3.soc1IndependentNameMode = true;
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc3.soc1Name                = "INV_IC";
adc3.soc2Name                = "INV_UC";
adc3.soc3Name                = "INV_UW";
adc3.soc3IndependentNameMode = true;
adc3.soc2IndependentNameMode = true;
adc3.soc2SampleWindow        = 9;
adc3.soc3SampleWindow        = 9;
adc3.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0Channel             = "ADC_CH_ADCIN4";
adc3.soc1Channel             = "ADC_CH_ADCIN8";
adc3.soc2Channel             = "ADC_CH_ADCIN14";
adc3.soc3Channel             = "ADC_CH_ADCIN6";
adc3.soc0Name                = "INV_IW";

fsi1.$name               = "myBoardFSI0";
fsi1.fsiRx.d0Qual.$name  = "myGPIOQUAL12";
fsi1.fsiRx.d1Qual.$name  = "myGPIOQUAL13";
fsi1.fsiRx.clkQual.$name = "myGPIOQUAL14";
fsi1.fsiTx.useCase       = "FSI TX Dual Dataline";
fsi1.fsiTx.d0Qual.$name  = "myGPIOQUAL15";
fsi1.fsiTx.d1Qual.$name  = "myGPIOQUAL16";
fsi1.fsiTx.clkQual.$name = "myGPIOQUAL17";

can1.$name                   = "IRIS_CAN";
can1.bitRate                 = "1000000";
can1.enableInterrupt         = true;
can1.registerInterrupts      = true;
can1.interruptFlags          = ["CAN_INT_IE0"];
can1.interruptLine           = ["CAN_GLOBAL_INT_CANINT0"];
can1.enableAutoBusOn         = true;
can1.AutoBusOnTimer          = 128;
can1.msgObjsUsed             = [1,2,3,4,5,6,7,8,9,10];
can1.can.$assign             = "CANA";
can1.can.can_rxPin.$assign   = "GPIO30";
can1.can.can_txPin.$assign   = "GPIO31";
can1.can0Int.enableInterrupt = true;
can1.msgObj1.$name           = "msgObj0";
can1.msgObj1.flags           = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can1.msgObj1.msgID           = 257;
can1.msgObj2.$name           = "msgObj1";
can1.msgObj2.msgID           = 258;
can1.msgObj2.flags           = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can1.msgObj3.$name           = "msgObj2";
can1.msgObj3.msgID           = 259;
can1.msgObj3.flags           = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can1.msgObj4.$name           = "msgObj3";
can1.msgObj4.msgID           = 513;
can1.msgObj4.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj4.msgLen          = 8;
can1.msgObj4.intLine         = "1";
can1.msgObj5.$name           = "msgObj4";
can1.msgObj5.msgID           = 514;
can1.msgObj5.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj5.msgLen          = 8;
can1.msgObj5.intLine         = "1";
can1.msgObj6.$name           = "msgObj5";
can1.msgObj6.msgID           = 515;
can1.msgObj6.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj6.msgLen          = 8;
can1.msgObj6.intLine         = "1";
can1.msgObj7.$name           = "msgObj7";
can1.msgObj7.msgID           = 516;
can1.msgObj7.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj7.msgLen          = 8;
can1.msgObj7.intLine         = "1";
can1.msgObj8.$name           = "msgObj6";
can1.msgObj8.msgID           = 517;
can1.msgObj8.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj8.msgLen          = 8;
can1.msgObj8.intLine         = "1";
can1.msgObj9.$name           = "msgObj8";
can1.msgObj9.msgID           = 518;
can1.msgObj9.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj9.msgLen          = 8;
can1.msgObj9.intLine         = "1";
can1.msgObj10.$name          = "msgObj9";
can1.msgObj10.msgID          = 519;
can1.msgObj10.msgType        = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj10.msgLen         = 8;
can1.msgObj10.intLine        = "1";

const divider2       = system.clockTree["LOSPCP"];
divider2.divideValue = 1;

const divider4       = system.clockTree["PLL_ODIV"];
divider4.divideValue = 2;

const divider5       = system.clockTree["PLL_REFDIV"];
divider5.divideValue = 4;

const multiplier1         = system.clockTree["PLL_IMULT"];
multiplier1.multiplyValue = 80;

const mux3       = system.clockTree["OSCCLKSRCSEL"];
mux3.inputSelect = "X1_XTAL";

const mux5       = system.clockTree["XTAL_OR_X1"];
mux5.inputSelect = "X1";

const pinFunction2     = system.clockTree["X1"];
pinFunction2.XTAL_Freq = 12;

const pinFunction3     = system.clockTree["XTAL"];
pinFunction3.XTAL_Freq = 12;

cputimer1.$name       = "myCPUTIMER0";
cputimer1.timerPeriod = 1000;

