zdfxdxy543/MotorAI/gmp_pro/ctl/suite/mcs_pmsm_nt - 副本/project/f280039c_Iris_node/F280039_Iris_node.syscfg
epwm4.$name                                                      = "IRIS_EPWM4";
epwm4.copyUse                                                    = true;
epwm4.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_periodLoadEvent                               = "EPWM_SHADOW_LOAD_MODE_COUNTER_SYNC";
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm4.epwmTimebase_phaseEnable                                   = true;
epwm4.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm4.epwmCounterCompare_cmpAGld                                 = true;
epwm4.epwmCounterCompare_cmpB                                    = 1500;
epwm4.epwmCounterCompare_cmpBGld                                 = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.epwmDeadband_enableRED                                     = true;
epwm4.epwmDeadband_enableFED                                     = true;
epwm4.epwmEventTrigger_enableInterrupt                           = true;
epwm4.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_PERIOD";
epwm4.epwmEventTrigger_interruptEventCount                       = "1";
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm4.epwmDeadband_delayRED                                      = 50;
epwm4.epwmDeadband_delayFED                                      = 50;
epwm4.copyFrom                                                   = "IRIS_EPWM1";
epwm4.epwmTimebase_period                                        = 3000;
epwm4.epwmCounterCompare_cmpA                                    = 1500;
epwm4.epwm.$assign                                               = "EPWM3";
epwm4.epwm.epwm_aPin.$assign                                     = "GPIO4";
epwm4.epwm.epwm_bPin.$assign                                     = "GPIO5";

epwm5.$name                                                      = "IRIS_EPWM5";
epwm5.copyUse                                                    = true;
epwm5.copyFrom                                                   = "IRIS_EPWM1";
epwm5.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_periodLoadEvent                               = "EPWM_SHADOW_LOAD_MODE_COUNTER_SYNC";
epwm5.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm5.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm5.epwmTimebase_phaseEnable                                   = true;
epwm5.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm5.epwmCounterCompare_cmpAGld                                 = true;
epwm5.epwmCounterCompare_cmpB                                    = 1500;
epwm5.epwmCounterCompare_cmpBGld                                 = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm5.epwmDeadband_enableRED                                     = true;
epwm5.epwmDeadband_delayRED                                      = 50;
epwm5.epwmDeadband_enableFED                                     = true;
epwm5.epwmDeadband_delayFED                                      = 50;
epwm5.epwmEventTrigger_enableInterrupt                           = true;
epwm5.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_PERIOD";
epwm5.epwmEventTrigger_interruptEventCount                       = "1";
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm5.epwmTimebase_period                                        = 3000;
epwm5.epwmCounterCompare_cmpA                                    = 1500;
epwm5.epwm.$assign                                               = "EPWM8";
epwm5.epwm.epwm_aPin.$assign                                     = "GPIO14";
epwm5.epwm.epwm_bPin.$assign                                     = "GPIO15";

epwm6.$name                                                      = "IRIS_EPWM6";
epwm6.copyUse                                                    = true;
epwm6.copyFrom                                                   = "IRIS_EPWM1";
epwm6.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_periodLoadEvent                               = "EPWM_SHADOW_LOAD_MODE_COUNTER_SYNC";
epwm6.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm6.epwmTimebase_phaseEnable                                   = true;
epwm6.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm6.epwmCounterCompare_cmpAGld                                 = true;
epwm6.epwmCounterCompare_cmpB                                    = 1500;
epwm6.epwmCounterCompare_cmpBGld                                 = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.epwmDeadband_enableRED                                     = true;
epwm6.epwmDeadband_delayRED                                      = 50;
epwm6.epwmDeadband_enableFED                                     = true;
epwm6.epwmDeadband_delayFED                                      = 50;
epwm6.epwmEventTrigger_enableInterrupt                           = true;
epwm6.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_PERIOD";
epwm6.epwmEventTrigger_interruptEventCount                       = "1";
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm6.epwmTimebase_period                                        = 3000;
epwm6.epwmCounterCompare_cmpA                                    = 1500;
epwm6.epwm.$assign                                               = "EPWM7";
epwm6.epwm.epwm_aPin.$assign                                     = "GPIO28";
epwm6.epwm.epwm_bPin.$assign                                     = "GPIO29";

eqep1.$name                      = "IRIS_EQEP1";
eqep1.useCase                    = "CUSTOM";
eqep1.useInterfacePins           = ["EQEP#_A","EQEP#_B","EQEP#_INDEX"];
eqep1.positionCounterMax         = 10000;
eqep1.enableModule               = true;
eqep1.swPositionInit             = true;
eqep1.eqep.$assign               = "EQEP1";
eqep1.eqep.eqep_aPin.$assign     = "B5, GPIO20";
eqep1.eqep.eqep_bPin.$assign     = "B11, GPIO21";
eqep1.eqep.eqep_indexPin.$assign = "GPIO13";

eqep2.$name                      = "IRIS_EQEP2";
eqep2.useCase                    = "CUSTOM";
eqep2.useInterfacePins           = ["EQEP#_A","EQEP#_B","EQEP#_INDEX"];
eqep2.positionCounterMax         = 10000;
eqep2.enableModule               = true;
eqep2.swPositionInit             = true;
eqep2.eqep.$assign               = "EQEP2";
eqep2.eqep.eqep_aPin.$assign     = "GPIO24";
eqep2.eqep.eqep_bPin.$assign     = "GPIO33";
eqep2.eqep.eqep_indexPin.$assign = "GPIO26";
eqep2.aQual.qualMode             = "GPIO_QUAL_3SAMPLE";
eqep2.bQual.qualMode             = "GPIO_QUAL_3SAMPLE";
eqep2.indexQual.qualMode         = "GPIO_QUAL_3SAMPLE";

gpio1.$name           = "IRIS_GPIO1";
gpio1.direction       = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign = "GPIO58";

gpio2.$name           = "IRIS_GPIO2";
gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign = "GPIO23";

gpio3.$name           = "IRIS_GPIO3";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO40";

gpio4.$name           = "IRIS_GPIO4";
gpio4.gpioPin.$assign = "GPIO44";

gpio5.$name           = "IRIS_GPIO5";
gpio5.gpioPin.$assign = "GPIO34";

gpio6.$name           = "IRIS_GPIO6";
gpio6.gpioPin.$assign = "GPIO47";

gpio7.$name           = "IRIS_LED1";
gpio7.direction       = "GPIO_DIR_MODE_OUT";
gpio7.gpioPin.$assign = "GPIO61";

gpio8.$name           = "IRIS_LED2";
gpio8.direction       = "GPIO_DIR_MODE_OUT";
gpio8.gpioPin.$assign = "GPIO59";

gpio9.$name           = "IRIS_GPIO_SPI_RST";
gpio9.direction       = "GPIO_DIR_MODE_OUT";
gpio9.gpioPin.$assign = "GPIO55";

i2c1.$name                  = "IRIS_IIC";
i2c1.i2c.$assign            = "I2CA";
i2c1.i2c.i2c_sdaPin.$assign = "GPIO56";
i2c1.i2c.i2c_sclPin.$assign = "GPIO57";

other1.useCase                   = "CUSTOM";
other1.useInterfacePins          = ["ADCSOCAO","SYNCOUT","TDI","TDO","X1","XCLKOUT","XRSn"];
other1.$name                     = "OTHER_PIN_DEFINITION";
other1.other.$assign             = "OTHER";
other1.other.adcsocaoPin.$assign = "GPIO8";
other1.other.syncoutPin.$assign  = "GPIO6";
other1.other.xclkoutPin.$assign  = "GPIO18, X2";
other1.other.tdoPin.$assign      = "GPIO37/TDO";
other1.other.tdiPin.$assign      = "GPIO35/TDI";
other1.other.x1Pin.$assign       = "GPIO19, X1";

sci1.enabledFIFOInterrupts      = ["SCI_INT_RXFF"];
sci1.selectRegisteredInterrupts = ["registerRxInt"];
sci1.$name                      = "IRIS_UART_RS232";
sci1.sci.$assign                = "SCIA";
sci1.sci.sci_rxPin.$assign      = "GPIO9";
sci1.sci.sci_txPin.$assign      = "GPIO48";
sci1.rxQual.$name               = "myGPIOQUAL0";
sci1.txQual.$name               = "myGPIOQUAL1";

sci2.$name                      = "IRIS_UART_USB";
sci2.enabledFIFOInterrupts      = ["SCI_INT_RXFF"];
sci2.selectRegisteredInterrupts = ["registerRxInt"];
sci2.enabledErrorInterrupts     = ["SCI_INT_FE","SCI_INT_OE"];
sci2.rxFifo                     = "SCI_FIFO_RX12";
sci2.baudRates                  = 921600;
sci2.sci.$assign                = "SCIB";
sci2.sci.sci_rxPin.$assign      = "GPIO41";
sci2.sci.sci_txPin.$assign      = "GPIO10";
sci2.rxQual.$name               = "myGPIOQUAL6";
sci2.txQual.$name               = "myGPIOQUAL7";
sci2.sciRXInt.enableInterrupt   = true;

spi1.$name          = "IRIS_SPI_FPGA_BRIDGE";
spi1.emulationMode  = "SPI_EMULATION_FREE_RUN";
spi1.mode           = "SPI_MODE_CONTROLLER";
spi1.useInterrupts  = false;
spi1.useHSMode      = true;
spi1.bitRate        = 15000000;
spi1.spi.$assign    = "SPIA";
spi1.picoQual.$name = "myGPIOQUAL2";
spi1.pociQual.$name = "myGPIOQUAL3";
spi1.clkQual.$name  = "myGPIOQUAL4";
spi1.pteQual.$name  = "myGPIOQUAL5";

spi2.$name                   = "IRIS_SPI_OUT";
spi2.spi.spi_picoPin.$assign = "GPIO60";
spi2.spi.spi_pociPin.$assign = "GPIO25";
spi2.spi.spi_clkPin.$assign  = "GPIO32";
spi2.spi.spi_ptePin.$assign  = "GPIO27";
spi2.picoQual.$name          = "myGPIOQUAL8";
spi2.pociQual.$name          = "myGPIOQUAL9";
spi2.clkQual.$name           = "myGPIOQUAL10";
spi2.pteQual.$name           = "myGPIOQUAL11";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
fsi1.fsiRx.fsirx.$suggestSolution              = "FSIRXA";
fsi1.fsiRx.fsirx.fsirx_d0Pin.$suggestSolution  = "GPIO52";
fsi1.fsiRx.fsirx.fsirx_d1Pin.$suggestSolution  = "GPIO53";
fsi1.fsiRx.fsirx.fsirx_clkPin.$suggestSolution = "GPIO54";
fsi1.fsiTx.fsitx.$suggestSolution              = "FSITXA";
fsi1.fsiTx.fsitx.fsitx_d0Pin.$suggestSolution  = "GPIO49";
fsi1.fsiTx.fsitx.fsitx_d1Pin.$suggestSolution  = "GPIO50";
fsi1.fsiTx.fsitx.fsitx_clkPin.$suggestSolution = "GPIO51";
epwm1.epwm.$suggestSolution                    = "EPWM2";
epwm1.epwm.epwm_aPin.$suggestSolution          = "GPIO2";
epwm1.epwm.epwm_bPin.$suggestSolution          = "GPIO3";
spi1.spi.spi_picoPin.$suggestSolution          = "GPIO16";
spi1.spi.spi_pociPin.$suggestSolution          = "GPIO17";
spi1.spi.spi_clkPin.$suggestSolution           = "GPIO12";
spi1.spi.spi_ptePin.$suggestSolution           = "GPIO11";
spi2.spi.$suggestSolution                      = "SPIB";
